# sequens --> რია რაღაცის თანმიმდევრობა მაგ. თუ დავწერთ ასეთ რამეს 
# print(score) 
# score= 12
# ეს არ იმუშავებს იმიტომ რომ ჯერ უნდა იყოს score და მერე უნდა იყოს print ეს არის სექუენს-ის მაგალითი ანუ ჯერ ერთი რამ ხდება მერე მეორე
#-----------------------------------------------------------------------------------------------------------------------------------------------
#iteration ---> არის გამეორება როდესაც ერთი და იგივე მეორდება მაგ x=x+1
#----------------------------------------------------------------------------------------------------------------------------------------------------
#selection --->რაღაცის არჩევა 